ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
	Wire.beginTransmission(MAC_CTRL_ID);
	Wire.write(0xFA); // The address of the register we want
	Wire.endTransmission(); // Send the data
	if(Wire.requestFrom(MAC_CTRL_ID, 6) != 6) return false;	// if not enough data, return false
	for(unsigned char ret=0;ret<6;ret++) {
		buffer[ret] = Wire.read();
	}
	return true;
#endif
}

void(* resetFunc) (void) = 0; // AVR software reset function

/** Initialize network with the given mac address and http port */

unsigned char OpenSprinkler::start_network() {
	lcd_print_line_clear_pgm(PSTR("Starting..."), 1);
	uint16_t httpport = (uint16_t)(iopts[IOPT_HTTPPORT_1]<<8) + (uint16_t)iopts[IOPT_HTTPPORT_0];

#ifdef ENABLE_DEBUG
#if defined(ESP32)
  //DEBUG_PRINTLN(F("ESP32 FS dir:"));
  //ESP32_FS_list_dir();
  DEBUG_PRINTLN(F("Starting network"));
#endif //ESP32
#endif 

#if defined(ESP8266) || defined(ESP32)

	#if defined(ESP32)
		useEth = false;
	#else
	if (start_ether()) {
		useEth = true;
		WiFi.mode(WIFI_OFF);
	} else {
		useEth = false;
	}
	#endif

	DEBUG_PRINT("ETH enabled: ");
	DEBUG_PRINTLN(useEth);
	DEBUG_PRINT("Wifi mode: ");
	DEBUG_PRINTLN(( get_wifi_mode() == WIFI_MODE_STA ) ?  F("STA") : F("AP"));
	
	// FIXME, just for testing
	//::start_server_ap();

	if((useEth || get_wifi_mode()==WIFI_MODE_STA) && otc.en>0 && otc.token.length()>=DEFAULT_OTC_TOKEN_LENGTH) {
		otf = new OTF::OpenThingsFramework(httpport, otc.server, otc.port, otc.token, false, ether_buffer, ETHER_BUFFER_SIZE);
		DEBUG_PRINTLN(F("Started OTF with remote connection"));
	} else {
		DEBUG_PRINT(F("OTF start with http_port "));
		DEBUG_PRINTLN(httpport);
		delay(500);
		otf = new OTF::OpenThingsFramework(httpport, ether_buffer, ETHER_BUFFER_SIZE);
		DEBUG_PRINTLN(F("Started OTF with just local connection"));
	}
	DEBUG_PRINTLN("DNSServer start");
	extern DNSServer *dns;
	if(get_wifi_mode() == WIFI_MODE_AP) dns = new DNSServer();
	if(update_server) { delete update_server; update_server = NULL; }
	DEBUG_PRINTLN(F("Setting update server"));
	#if defined(ESP8266)
	update_server = new ESP8266WebServer(8080);
	#elif defined(ESP32)
	//DEBUG_PRINTLN(F("Starting MDNS service"));
	//MDNS.addService("_http", "_tcp", 8080 );
	//MDNS.addServiceTxt("_http", "_tcp", "path", "/");
	//      MDNS.addService("_http", "_udp", 80 );
	update_server = new WebServer(8080);
	#endif
	DEBUG_PRINTLN(F("Started update server"));
	return 1;

#else

	if (start_ether()) {
		if(m_server)	{ delete m_server; m_server = NULL; }
		m_server = new EthernetServer(httpport);
		m_server->begin();
		useEth = true;
		return 1;
	}	else {
		useEth = false;
		return 0;
	}

#endif
}

unsigned char OpenSprinkler::start_ether() {
#if defined(ESP8266)
	if(hw_rev<2) return 0;  // ethernet capability is only available when hw_rev>=2
	eth.isW5500 = (hw_rev==2)?false:true; // os 3.2 uses enc28j60 and 3.3 uses w5500

	SPI.begin();
	SPI.setBitOrder(MSBFIRST);
	SPI.setDataMode(SPI_MODE0);
	SPI.setFrequency(ETHER_SPI_CLOCK); // set SPI frequency

	if(eth.isW5500) {
		DEBUG_PRINTLN(F("detect existence of W5500"));
		/* this is copied from w5500.cpp wizchip_sw_reset
		 * perform a software reset and see if we get a correct response
		 * without this, eth.begin will crash if W5500 is not connected
		 * ideally wizchip_sw_reset should return a value but since it doesn't
		 * we have to extract it code here
		 * */
		static const uint8_t AccessModeRead = (0x00 << 2);
		static const uint8_t AccessModeWrite = (0x01 << 2);
		static const uint8_t BlockSelectCReg = (0x00 << 3);
		pinMode(PIN_ETHER_CS, OUTPUT);
		// ==> setMR(MR_RST)
		digitalWrite(PIN_ETHER_CS, LOW);
		SPI.transfer((0x00 & 0xFF00) >> 8);
		SPI.transfer((0x00 & 0x00FF) >> 0);
		SPI.transfer(BlockSelectCReg | AccessModeWrite);
		SPI.transfer(0x80);
		digitalWrite(PIN_ETHER_CS, HIGH);

		// ==> ret = getMR()
		uint8_t ret;
		digitalWrite(PIN_ETHER_CS, LOW);
		SPI.transfer((0x00 & 0xFF00) >> 8);
		SPI.transfer((0x00 & 0x00FF) >> 0);
		SPI.transfer(BlockSelectCReg | AccessModeRead);
		ret = SPI.transfer(0);
		digitalWrite(PIN_ETHER_CS, HIGH);
		if(ret!=0) return 0; // ret is expected to be 0
	} else {
		/* this is copied from enc28j60.cpp geterevid
		 * check to see if the hardware revision number if expected
		 * */
		DEBUG_PRINTLN(F("detect existence of ENC28J60"));
		#define MAADRX_BANK 0x03
		#define EREVID 0x12
		#define ECON1 0x1f

		// ==> setregbank(MAADRX_BANK);
		pinMode(PIN_ETHER_CS, OUTPUT);
		uint8_t r;
		digitalWrite(PIN_ETHER_CS, LOW);
		SPI.transfer(0x00 | (ECON1 & 0x1f));
		r = SPI.transfer(0);
		digitalWrite(PIN_ETHER_CS, HIGH);

		digitalWrite(PIN_ETHER_CS, LOW);
		SPI.transfer(0x40 | (ECON1 & 0x1f));
		SPI.transfer((r & 0xfc) | (MAADRX_BANK & 0x03));
		digitalWrite(PIN_ETHER_CS, HIGH);

		// ==> r = readreg(EREVID);
		digitalWrite(PIN_ETHER_CS, LOW);
		SPI.transfer(0x00 | (EREVID & 0x1f));
		r = SPI.transfer(0);
		digitalWrite(PIN_ETHER_CS, HIGH);
		if(r==0 || r==255) return 0; // r is expected to be a non-255 revision number
	}

	load_hardware_mac((uint8_t*)tmp_buffer, true);
	if (iopts[IOPT_USE_DHCP]==0) { // config static IP before calling eth.begin
		IPAddress staticip(iopts+IOPT_STATIC_IP1);
		IPAddress gateway(iopts+IOPT_GATEWAY_IP1);
		IPAddress dns(iopts+IOPT_DNS_IP1);
		IPAddress subn(iopts+IOPT_SUBNET_MASK1);
		eth.config(staticip, gateway, subn, dns);
	}
	eth.setDefault();
	if(!eth.begin((uint8_t*)tmp_buffer))	return 0;
	lcd_print_line_clear_pgm(PSTR("Start wired link"), 1);
	lcd_print_line_clear_pgm(eth.isW5500 ? PSTR("  [w5500]    ") : PSTR(" [enc28j60]  "), 2);

	ulong timeout = millis()+60000; // 60 seconds time out
	unsigned char timecount = 1;
	while (!eth.connected() && (long)(millis()-timeout)<0) { // overflow proof
		DEBUG_PRINT(".");
		lcd.setCursor(13, 2);
		lcd.print(timecount);
		delay(1000);
		timecount++;
	}
	lcd_print_line_clear_pgm(PSTR(""), 2);
	if(eth.connected()) {
		// if wired connection is successful at this point, copy the network ips to config
		if (iopts[IOPT_USE_DHCP]) {
			memcpy(iopts+IOPT_STATIC_IP1, &(eth.localIP()[0]), 4);
			memcpy(iopts+IOPT_GATEWAY_IP1, &(eth.gatewayIP()[0]),4);
			memcpy(iopts+IOPT_DNS_IP1, &(WiFi.dnsIP()[0]), 4); // todo: lwip need dns ip
			memcpy(iopts+IOPT_SUBNET_MASK1, &(eth.subnetMask()[0]), 4);
			iopts_save();
		}
		return 1;
	} else {
		// if wired connection has failed at this point, return depending on whether the user wants to force wired
		return (iopts[IOPT_FORCE_WIRED] ? 1 : 0);
	}
#elif defined(ESP32)
	// no wired network support now
	return 0;
#else
	Ethernet.init(PIN_ETHER_CS);  // make sure to call this before any Ethernet calls
	if(Ethernet.hardwareStatus()==EthernetNoHardware) return 0;
	load_hardware_mac((uint8_t*)tmp_buffer, true);

