ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
		pinMode(16, INPUT);
		if(digitalRead(16)==LOW) {
			// revision 1
			hw_rev = 1;
			if(detect_i2c(ACDR_I2CADDR)) {
				hw_type = HW_TYPE_AC;
				drio = new PCA9555(ACDR_I2CADDR);
			} else if(detect_i2c(DCDR_I2CADDR)) {
				hw_type = HW_TYPE_DC;
				drio = new PCA9555(DCDR_I2CADDR);
			} else if(detect_i2c(LADR_I2CADDR)) {
				hw_type = HW_TYPE_LATCH;
				drio = new PCA9555(LADR_I2CADDR);
			} else {
				hw_type = HW_TYPE_UNKNOWN;
				drio = new PCA9555(ACDR_I2CADDR);
			}
			mainio = drio;

			mainio->i2c_write(NXP_CONFIG_REG, V1_IO_CONFIG);
			mainio->i2c_write(NXP_OUTPUT_REG, V1_IO_OUTPUT);

			PIN_BUTTON_1 = V1_PIN_BUTTON_1;
			PIN_BUTTON_2 = V1_PIN_BUTTON_2;
			PIN_BUTTON_3 = V1_PIN_BUTTON_3;
			PIN_RFRX = V1_PIN_RFRX;
			PIN_RFTX = V1_PIN_RFTX;
			PIN_IOEXP_INT = V1_PIN_IOEXP_INT;
			PIN_BOOST = V1_PIN_BOOST;
			PIN_BOOST_EN = V1_PIN_BOOST_EN;
			PIN_LATCH_COM = V1_PIN_LATCH_COM;
			PIN_SENSOR1 = V1_PIN_SENSOR1;
			PIN_SENSOR2 = V1_PIN_SENSOR2;
		} else { // revision 2 and above
			// conditions for revision 4:
			// * has I2C EEPROM @ 0x52? --> OS 3.4 AC (skipping 0x51 due to conflict with PCF8563)
			// * has CH224A/Q @ both 0x22, 0x23? --> OS 3.4 DC
			bool has_eeprom_2 = detect_i2c(EEPROM_I2CADDR+2);
			bool has_ch224_0 = detect_i2c(CH224_I2CADDR);
			bool has_ch224_1 = detect_i2c(CH224_I2CADDR+1);
			if(has_eeprom_2 || (has_ch224_0 && has_ch224_1)) {
				hw_rev = 4;
				drio = new PCA9555(ACDR_I2CADDR); // all OS 3.4 models have IOEXP at 0x21 due to address conflicts with CH224
				mainio = drio;
				if(has_ch224_0 && has_ch224_1) {
					hw_type = HW_TYPE_DC;
					usbpd.begin();
				} else {
					hw_type = HW_TYPE_AC;
				}
			} else {
				if(detect_i2c(EEPROM_I2CADDR)) { // revision 3 has an I2C EEPROM at this address
					hw_rev = 3;
				} else {
					hw_rev = 2;
				}
				if(detect_i2c(ACDR_I2CADDR)) {
					hw_type = HW_TYPE_AC;
					drio = new PCA9555(ACDR_I2CADDR);
				} else if(detect_i2c(DCDR_I2CADDR)) {
					hw_type = HW_TYPE_DC;
					drio = new PCA9555(DCDR_I2CADDR);
				} else if(detect_i2c(LADR_I2CADDR)) {
					hw_type = HW_TYPE_LATCH;
					drio = new PCA9555(LADR_I2CADDR);
				} else {
					hw_type = HW_TYPE_UNKNOWN;
					drio = new PCA9555(ACDR_I2CADDR);
				}
			}
			mainio = drio;

			mainio->i2c_write(NXP_CONFIG_REG, V2_IO_CONFIG);
			mainio->i2c_write(NXP_OUTPUT_REG, V2_IO_OUTPUT);

			PIN_BUTTON_1 = V2_PIN_BUTTON_1;
			PIN_BUTTON_2 = V2_PIN_BUTTON_2;
			PIN_BUTTON_3 = V2_PIN_BUTTON_3;
			PIN_RFTX = V2_PIN_RFTX;
			PIN_BOOST = V2_PIN_BOOST;
			PIN_BOOST_EN = V2_PIN_BOOST_EN;
			PIN_LATCH_COMK = V2_PIN_LATCH_COMK; // os3.2latch uses H-bridge separate cathode and anode design
			PIN_LATCH_COMA = V2_PIN_LATCH_COMA;
			PIN_SENSOR1 = V2_PIN_SENSOR1;
			PIN_SENSOR2 = V2_PIN_SENSOR2;
		}
	}

	/* detect expanders */
	for(unsigned char i=0;i<(MAX_NUM_BOARDS)/2;i++)
		expanders[i] = NULL;
	detect_expanders();
#elif defined(ESP32)

	//DEBUG_PRINTLN("ESP32");

    hw_type = HW_TYPE_AC;

	// PIN_RFRX = E0_PIN_RFRX;
	// PIN_RFTX = E0_PIN_RFTX;
	// PIN_BOOST = E0_PIN_BOOST;
	// PIN_BOOST_EN = E0_PIN_BOOST_EN;
	PIN_SENSOR1 = E0_PIN_SENSOR1;
	PIN_SENSOR2 = E0_PIN_SENSOR2;

	#if defined(ETHPORT)
		hw_rev = 2;
	#else
		hw_rev = 0;
	#endif
 	

	  // mainio = new IOEXP(ACDR_I2CADDR); // dont need this as all is handled by ESP32 gpio's

	  DEBUG_PRINTLN("IOEXP Setup");

  #if ! defined(USE_IOEXP_SR) || ( defined(USE_IOEXP_SR) && USE_IOEXP_SR != 1 )
  	DEBUG_PRINTLN("Using GPIO IOEXP");
	drio = new BUILD_IN_GPIO(); // to handle gpio's on ESP32 board
	drio->set_pins_output_mode();
  #else
  	DEBUG_PRINTLN(F("Using Shift-register IOEXP"));
	drio = new IOEXP_SR();
	DEBUG_PRINTLN(F("Driver class initiated"));
	drio->set_pins_output_mode();
	DEBUG_PRINTLN("PIN SETUP COMPLETE");
  #endif
	// ROTARY ENCODER not supported now
	#if ! defined(USE_ROTARY_ENCODER)
		PIN_BUTTON_1 = E0_PIN_BUTTON_1;
		PIN_BUTTON_2 = E0_PIN_BUTTON_2;
		PIN_BUTTON_3 = E0_PIN_BUTTON_3;
		
		pinMode(PIN_BUTTON_1, INPUT_PULLUP);
		pinMode(PIN_BUTTON_2, INPUT_PULLUP);
		//pinMode(PIN_BUTTON_3, INPUT_PULLUP);
	#else
		DEBUG_PRINTLN(F("Rotary encoder enabled"));
		PIN_BUTTON_1 = ROTARY_ENCODER_A_PIN;
		PIN_BUTTON_2 = ROTARY_ENCODER_BUTTON_PIN;
		PIN_BUTTON_3 = ROTARY_ENCODER_B_PIN;

		pinMode(PIN_BUTTON_1, INPUT_PULLUP);
		pinMode(PIN_BUTTON_2, INPUT_PULLUP);
		pinMode(PIN_BUTTON_3, INPUT_PULLUP);

		attachInterrupt(digitalPinToInterrupt(ROTARY_ENCODER_A_PIN), OpenSprinkler::handleRotaryEncoderRotate, CHANGE);

	#endif // Button PINs configuration

	/* TODO - interrupt driven button/rotary encoder */

	/* detect expanders */
	for(byte i=0;i<(MAX_NUM_BOARDS)/2;i++)
		expanders[i] = NULL;
	DEBUG_PRINTLN("Starting to detect expanders");
	detect_expanders();
	DEBUG_PRINTLN("Expanders detected");

	DEBUG_PRINT("hw_type = "); DEBUG_PRINT(hw_type); DEBUG_PRINT(" hw_rev = "); DEBUG_PRINTLN(hw_rev);
#else

	#if defined(PIN_SR_OE)
		DEBUG_PRINTLN("SR OE Setup");
	// shift register setup
	pinMode(PIN_SR_OE, OUTPUT);
	// pull shift register OE high to disable output
	digitalWrite(PIN_SR_OE, HIGH);
	#endif
	#if defined(PIN_SR_LATCH) && PIN_SR_LATCH != 255
		DEBUG_PRINTLN("SR Latch Setup");
	pinMode(PIN_SR_LATCH, OUTPUT);
	digitalWrite(PIN_SR_LATCH, HIGH);

	pinMode(PIN_SR_CLOCK, OUTPUT);
	#endif

	#if defined(OSPI)
		pin_sr_data = PIN_SR_DATA;
		// detect RPi revision
		unsigned int rev = detect_rpi_rev();
		if (rev==0x0002 || rev==0x0003)
			pin_sr_data = PIN_SR_DATA_ALT;
		// if this is revision 1, use PIN_SR_DATA_ALT
		pinMode(pin_sr_data, OUTPUT);
	#elif defined(PIN_SR_DATA)
		DEBUG_PRINTLN("SR Data Setup");
		pinMode(PIN_SR_DATA, OUTPUT);
	#endif

#endif // endif expanders setup

#if defined(OSPI)
pinModeExt(PIN_BUTTON_1, INPUT_PULLUP);
pinModeExt(PIN_BUTTON_2, INPUT_PULLUP);
pinModeExt(PIN_BUTTON_3, INPUT_PULLUP);
#endif

	// init masters_last_on array
	memset(masters_last_on, 0, sizeof(masters_last_on));

	DEBUG_PRINT("Resetting stations... ");
	// Reset all stations
	clear_all_station_bits();
	DEBUG_PRINT(" clear OK ");
	apply_all_station_bits();
	DEBUG_PRINTLN("Done");

#if defined(ESP8266) || defined(ESP32)
	DEBUG_PRINTLN("Starting sensors - INPUT_PULLUP");
 	DEBUG_PRINT("Sensor1 PIN: "); DEBUG_PRINTLN(PIN_SENSOR1);
  	DEBUG_PRINT("Sensor2 PIN: "); DEBUG_PRINTLN(PIN_SENSOR2);

	// OS 3.0 has two independent sensors
	pinModeExt(PIN_SENSOR1, INPUT_PULLUP);
	#if defined(ESP8266) || defined(PIN_SENSOR2) || defined(E0_PIN_SENSOR2)
	pinModeExt(PIN_SENSOR2, INPUT_PULLUP);
	#endif
	
#else
	// pull shift register OE low to enable output
	digitalWrite(PIN_SR_OE, LOW);
	// Rain sensor port set up
	pinMode(PIN_SENSOR1, INPUT_PULLUP);
	#if defined(PIN_SENSOR2) || defined(E0_PIN_SENSOR2)
	pinMode(PIN_SENSOR2, INPUT_PULLUP);
	#endif
#endif

	// Default controller status variables
	// Static variables are assigned 0 by default
	// so only need to initialize non-zero ones
	status.enabled = 1;
	status.safe_reboot = 0;

	old_status = status;

	nvdata.sunrise_time = 360;  // 6:00am default sunrise
	nvdata.sunset_time = 1080;  // 6:00pm default sunset
	nvdata.reboot_cause = REBOOT_CAUSE_POWERON;

