ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
	nboards = 1;
	nstations = nboards*8;

	// set rf data pin, unless it is not being used
	if(PIN_RFTX != 255) {
		DEBUG_PRINTLN("Starting RFTX pins ");
		DEBUG_PRINT("RFTX PIN: "); DEBUG_PRINTLN(PIN_RFTX);
		pinModeExt(PIN_RFTX, OUTPUT);
		digitalWriteExt(PIN_RFTX, LOW);
	} else {
		DEBUG_PRINTLN("Skipping RFTX setup");
	}

#if defined(ARDUINO)  // AVR SD and LCD functions

	#if defined(ESP8266) || defined(ESP32)  // OS3.0 specific detections
		#if PIN_CURR_SENSE != 255
		status.has_curr_sense = 1;  // OS3.0 has current sensing capacility
		# else
		status.has_curr_sense = 0;  // OS3.0 has current sensing capacility
		#endif
		// measure baseline current
		baseline_current = 80;

	#else // OS 2.3 specific detections

		// detect hardware type
		if (detect_i2c(MAC_CTRL_ID)) {
			Wire.beginTransmission(MAC_CTRL_ID);
			Wire.write(0x00);
			Wire.endTransmission();
			Wire.requestFrom(MAC_CTRL_ID, 1);
			unsigned char ret = Wire.read();
			if (ret == HW_TYPE_AC || ret == HW_TYPE_DC || ret == HW_TYPE_LATCH) {
				hw_type = ret;
			} else {
				hw_type = HW_TYPE_AC; // if type not supported, make it AC
			}
		}

		if (hw_type == HW_TYPE_DC) {
			pinMode(PIN_BOOST, OUTPUT);
			digitalWrite(PIN_BOOST, LOW);

			pinMode(PIN_BOOST_EN, OUTPUT);
			digitalWrite(PIN_BOOST_EN, LOW);
		}

		// detect if current sensing pin is present
		pinMode(PIN_CURR_DIGITAL, INPUT);
		digitalWrite(PIN_CURR_DIGITAL, HIGH); // enable internal pullup
		status.has_curr_sense = digitalRead(PIN_CURR_DIGITAL) ? 0 : 1;
		digitalWrite(PIN_CURR_DIGITAL, LOW);
		baseline_current = 0;

	#endif //endif current_sens setup
#endif
#if defined(USE_DISPLAY)

	DEBUG_PRINT("Display startup - ");
	#if defined(USE_SSD1306) 
		DEBUG_PRINTLN("SSD1306");
	#elif defined(USE_SH1106)
		DEBUG_PRINTLN("1106");
	#else 
		DEBUG_PRINLN("Unknown");
	#endif

	lcd_start();

	#if defined(USE_SSD1306) || defined(USE_SH1106)
		#ifndef ESP32
		lcd.createChar(ICON_ETHER_CONNECTED, _iconimage_ether_connected);
		lcd.createChar(ICON_ETHER_DISCONNECTED, _iconimage_ether_disconnected);
		#endif
		lcd.createChar(ICON_WIFI_CONNECTED, _iconimage_wifi_connected);
		lcd.createChar(ICON_WIFI_DISCONNECTED, _iconimage_wifi_disconnected);
	#elif defined(USE_LCD)
		lcd.createChar(ICON_ETHER_CONNECTED, _iconimage_connected);
		lcd.createChar(ICON_ETHER_DISCONNECTED, _iconimage_disconnected);
	#endif

	lcd.createChar(ICON_REMOTEXT, _iconimage_remotext);
	lcd.createChar(ICON_RAINDELAY, _iconimage_raindelay);
	lcd.createChar(ICON_RAIN, _iconimage_rain);
	lcd.createChar(ICON_SOIL, _iconimage_soil);
#endif

#if defined(ARDUINO)

	#if defined(ESP8266) || defined(ESP32)

		/* create custom wifi icon characters */
		// lcd.createChar(ICON_WIFI_CONNECTED, _iconimage_wifi_connected);
		// lcd.createChar(ICON_WIFI_DISCONNECTED, _iconimage_wifi_disconnected);

		lcd.setCursor(0,0);
		lcd.print(F("Init file system"));
		DEBUG_PRINT("Init file system... ");
		lcd.setCursor(0,1);
		lcd.print(F("Please wait..."));
		#if defined(ESP8266)
		if(!LittleFS.begin()) {
		#elif defined(ESP32)
			// Get the size of the flash memory
			uint32_t flash_size = ESP.getFlashChipSize();
			
			DEBUG_PRINTLN();
			DEBUG_PRINT(F("Flash size: "));
			DEBUG_PRINT(flash_size);
			DEBUG_PRINTLN(F(" bytes"));			

			#if defined(ESP32_LIST_PARTITIONS)
			DEBUG_PRINTLN(F("ESP32 Partition table:"));

			DEBUG_PRINTLN(F("| Type | Sub |  Offset  |   Size   |       Label      |"));
			DEBUG_PRINTLN(F("| ---- | --- | -------- | -------- | ---------------- |"));
			
			esp_partition_iterator_t pi = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
			if (pi != NULL) {
				do {
				const esp_partition_t* p = esp_partition_get(pi);
				printf("|  %02x  | %02x  | 0x%06X | 0x%06X | %-16s |\r\n", 
					p->type, p->subtype, p->address, p->size, p->label);
				} while (pi = (esp_partition_next(pi)));
			}
			#endif
		if(!LittleFS.begin(ESP32_FORMAT_FS_IF_FAILED)) {
		#endif

			// !!! flash init failed, stall as we cannot proceed
			lcd.setCursor(0, 0);
			lcd_print_pgm(PSTR("Error Code: 0x2D"));
			DEBUG_PRINTLN(F("FAILED."));
			delay(10000);
			//reboot_dev(REBOOT_CAUSE_PROGRAM);
		#if defined(ESP32)
		} else {
			ESP32_listDir("/",2);
			
			ESP32_readFile(IOPTS_FILENAME);
		#endif
		}
		DEBUG_PRINTLN(F("Done."));
		lcd.clear(0,0);
		lcd.clear(0,1);
		lcd.clear(0,2);

		state = OS_STATE_INITIAL;

	#else

		// set sd cs pin high to release SD
		pinMode(PIN_SD_CS, OUTPUT);
		digitalWrite(PIN_SD_CS, HIGH);

		if(!sd.begin(PIN_SD_CS, SPI_HALF_SPEED)) {
			// !!! sd card not detected, stall as we cannot proceed
			lcd.setCursor(0, 0);
			lcd_print_pgm(PSTR("Error Code: 0x2D"));
			while(1){}
		}

	#endif

	// set button pins
	// enable internal pullup
	pinModeExt(PIN_BUTTON_1, INPUT_PULLUP);
	pinModeExt(PIN_BUTTON_2, INPUT_PULLUP);
	//pinModeExt(PIN_BUTTON_3, INPUT_PULLUP);

	// Rotary knob setup should happen here!

	// detect and check RTC type
	DEBUG_PRINT(F("Detecting RTC..."));
	RTC.detect();
	DEBUG_PRINTLN(F("done."));

	#if defined(ESP32)
		// workaround for OTF, otherwise LocalServer failes
		start_network_ap(wifi_ssid.c_str(),wifi_pass.c_str());
	#endif
	
	
	#if defined(SYS_STATUS_LED_PIN)
		pinMode(SYS_STATUS_LED_PIN,OUTPUT);
		digitalWrite(SYS_STATUS_LED_PIN,HIGH);
		delayMicroseconds(200000);
		digitalWrite(SYS_STATUS_LED_PIN,LOW);
		delayMicroseconds(100000);
		digitalWrite(SYS_STATUS_LED_PIN,HIGH);
		delayMicroseconds(200000);
		digitalWrite(SYS_STATUS_LED_PIN,LOW);
	#endif
		
	DEBUG_PRINTLN("INIT::begin Completed");
#else
	//DEBUG_PRINTLN(get_runtime_path());
#endif
}

#if defined(ESP8266)
/** Setup PD voltage
 *
 */
void OpenSprinkler::setup_pd_voltage() {
	actual_pd_voltage = 0;
	if(!(hw_rev==4 && hw_type==HW_TYPE_DC)) return;
	if(usbpd.update_power_data()) {
		uint16_t tpdv = iopts[IOPT_TARGET_PD_VOLTAGE];
		if(tpdv < 50) tpdv = DEFAULT_TARGET_PD_VOLTAGE; // anything below 5.0V will be force converted to default tpdv
		usbpd.request_voltage_closest(tpdv*100);
		delay(200);
		actual_pd_voltage = usbpd.get_output_voltage_mv()/100; // read back the actual voltage
	} else {
		// the power source does not support PD
	}
}

/** LATCH boost voltage
 *
 */
void OpenSprinkler::latch_boost(int8_t volt) {
	// if volt is negative or larger than max volt, ignore it and boost according to BOOST_TIME only
	if(volt<0 || volt>iopt_max[IOPT_LATCH_ON_VOLTAGE]) {
		digitalWriteExt(PIN_BOOST, HIGH);      // enable boost converter
		delay((int)iopts[IOPT_BOOST_TIME]<<2); // wait for booster to charge
		digitalWriteExt(PIN_BOOST, LOW);       // disable boost converter
	} else {
		if(volt == 0) volt = DEFAULT_LATCH_BOOST_VOLTAGE;
		// boost to specified volt, up to time specified by BOOST_TIME
		uint16_t top = (uint16_t)(volt * 19.25f); // ADC = 1024 * volt * 1.5k / 79.8k
		if(analogRead(PIN_CURR_SENSE)>=top) return; // if the voltage has already reached top, return right away
		uint32_t boost_timeout = millis() + (iopts[IOPT_BOOST_TIME]<<2);
		digitalWriteExt(PIN_BOOST, HIGH);
		// boost until either top voltage is reached or boost timeout is reached
		while((long)(millis()-boost_timeout)<0 && analogRead(PIN_CURR_SENSE)<top) { // overflow proof
			delay(5);
		}
		digitalWriteExt(PIN_BOOST, LOW);
	}
}

/** Set all zones (for LATCH controller)
 *  This function sets all zone pins (including COM) to a specified value
 */
void OpenSprinkler::latch_setallzonepins(unsigned char value) {
	digitalWriteExt(PIN_LATCH_COM, value);  // set latch com pin
	// Handle driver board (on main controller)
	if(drio->type==IOEXP_TYPE_9555) { // LATCH contorller only uses PCA9555, no other type
		uint16_t reg = drio->i2c_read(NXP_OUTPUT_REG);  // read current output reg value
		if(value) reg |= 0x00FF;  // first 8 zones are the lowest 8 bits of main driver board
		else reg &= 0xFF00;
		drio->i2c_write(NXP_OUTPUT_REG, reg); // write value to register
	}
	// Handle all expansion boards
	for(unsigned char i=0;i<MAX_EXT_BOARDS/2;i++) {
		if(expanders[i]->type==IOEXP_TYPE_9555) {
			expanders[i]->i2c_write(NXP_OUTPUT_REG, value?0xFFFF:0x0000);
		}
	}
}

void OpenSprinkler::latch_disable_alloutputs_v2() {
	digitalWriteExt(PIN_LATCH_COMA, LOW);
	digitalWriteExt(PIN_LATCH_COMK, LOW);

	// latch v2 has a pca9555 the lowest 8 bits of which control all h-bridge anode pins
	drio->i2c_write(NXP_OUTPUT_REG, drio->i2c_read(NXP_OUTPUT_REG) & 0xFF00);
	// latch v2 has a 74hc595 which controls all h-bridge cathode pins
	drio->shift_out(V2_PIN_SRLAT, V2_PIN_SRCLK, V2_PIN_SRDAT, 0x00);

