ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
/** Read current sensing value
 * OpenSprinkler 2.3 and above have a 0.2 ohm current sensing resistor.
 * Therefore the conversion from analog reading to milli-amp is:
 * (r/1024)*3.3*1000/0.2 (DC-powered controller)
 * AC-powered controller has a built-in precision rectifier to sense
 * the peak AC current. Therefore the actual current is discounted by 0.707
 * ESP8266's analog reference voltage is 1.0 instead of 3.3, therefore
 * it's further discounted by 1/3.3
 */
#if defined(ARDUINO)
uint16_t OpenSprinkler::read_current(bool use_ema) {
	static uint16_t ema = 0; // exponential moving average
	static float scale = -1;
	if(scale < 0) { // assign scale upon first call of this function
		if (hw_type == HW_TYPE_DC) {
			#if defined(ESP8266) || defined(ESP32)
			scale = 4.88;
			#else
			scale = 16.11;
			#endif
		} else if (hw_type == HW_TYPE_AC) {
			#if defined(ESP8266) || defined(ESP32)
			scale = 3.45;
			#else
			scale = 11.39;
			#endif
		} else {
			scale = 0.0;  // for other controllers, current is 0
		}
	}
	uint16_t curr = analogRead(PIN_CURR_SENSE)*scale;
	ema = curr / 5 + ema * 4 / 5; // using alpha=0.2 for exponential moving average
	return use_ema ? ema : curr;
}
#endif

/** Read the number of 8-station expansion boards */
// AVR has capability to detect number of expansion boards
int OpenSprinkler::detect_exp() {
#if defined(ARDUINO)
	#if defined(ESP8266) || defined(ESP32)
	// detect the highest expansion board index
	int n;
	for(n=4;n>=0;n--) {
		if(detect_i2c(EXP_I2CADDR_BASE+n)) break;
	}
	return (n+1)*2;
	#else
	// OpenSprinkler uses voltage divider to detect expansion boards
	// Master controller has a 1.6K pull-up;
	// each expansion board (8 stations) has 2x 4.7K pull-down connected in parallel;
	// so the exact ADC value for n expansion boards is:
	//		ADC = 1024 * 9.4 / (10 + 9.4 * n)
	// Reverse this fomular we have:
	//		n = (1024 * 9.4 / ADC - 9.4) / 1.6
	int n = (int)((1024 * 9.4 / analogRead(PIN_EXP_SENSE) - 9.4) / 1.6 + 0.33);
	return n;
	#endif
#else
	return -1;
#endif
}

/** Convert hex code to ulong integer */
static ulong hex2ulong(unsigned char *code, unsigned char len) {
	char c;
	ulong v = 0;
	for(unsigned char i=0;i<len;i++) {
		c = code[i];
		v <<= 4;
		if(c>='0' && c<='9') {
			v += (c-'0');
		} else if (c>='A' && c<='F') {
			v += 10 + (c-'A');
		} else if (c>='a' && c<='f') {
			v += 10 + (c-'a');
		} else {
			return 0;
		}
	}
	return v;
}

/** Parse RF  station data into code */
bool OpenSprinkler::parse_rfstation_code(RFStationData *data, RFStationCode *code) {
	if(!code) return false;
	code->timing = 0; // temporarily set it to 0
	if(data->version=='H') {
		// this is version G rf code data (25 bytes long including version signature at the beginning)
		code->on = hex2ulong(data->on, sizeof(data->on));
		code->off = hex2ulong(data->off, sizeof(data->off));
		code->timing = hex2ulong(data->timing, sizeof(data->timing));
		code->protocol = hex2ulong(data->protocol, sizeof(data->protocol));
		code->bitlength = hex2ulong(data->bitlength, sizeof(data->bitlength));
	} else {
		// this is classic rf code data (16 bytes long, assuming protocol=1 and bitlength=24)
		RFStationDataClassic *classic = (RFStationDataClassic*)data;
		code->on = hex2ulong(classic->on, sizeof(classic->on));
		code->off = hex2ulong(classic->off, sizeof(classic->off));
		code->timing = hex2ulong(classic->timing, sizeof(classic->timing));
		code->protocol = 1;
		code->bitlength = 24;
	}
	if(!code->timing) return false;
	return true;
}

/** Get station data */
void OpenSprinkler::get_station_data(unsigned char sid, StationData* data) {
	file_read_block(STATIONS_FILENAME, data, (uint32_t)sid*sizeof(StationData), sizeof(StationData));
}

/** Set station data */
/*
void OpenSprinkler::set_station_data(unsigned char sid, StationData* data) {
	file_write_block(STATIONS_FILENAME, data, (uint32_t)sid*sizeof(StationData), sizeof(StationData));
}
*/

/** Get station name */
void OpenSprinkler::get_station_name(unsigned char sid, char tmp[]) {
	tmp[STATION_NAME_SIZE]=0;
	file_read_block(STATIONS_FILENAME, tmp, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, name), STATION_NAME_SIZE);
}

/** Set station name */
void OpenSprinkler::set_station_name(unsigned char sid, char tmp[]) {
	tmp[STATION_NAME_SIZE]=0;
	char n0[STATION_NAME_SIZE+1];
	get_station_name(sid, n0);
	size_t len = strlen(n0);
	if(len!=strlen(tmp) || memcmp(n0, tmp, len)!=0) { // only write if the name has changed
		file_write_block(STATIONS_FILENAME, tmp, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, name), STATION_NAME_SIZE);
	}
}

/** Get station type */
unsigned char OpenSprinkler::get_station_type(unsigned char sid) {
	return file_read_byte(STATIONS_FILENAME, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, type));
}

unsigned char OpenSprinkler::is_sequential_station(unsigned char sid) {
	return attrib_grp[sid] != PARALLEL_GROUP_ID;
}

unsigned char OpenSprinkler::is_master_station(unsigned char sid) {
	for (unsigned char mas = 0; mas < NUM_MASTER_ZONES; mas++) {
		if (get_master_id(mas) && (get_master_id(mas) - 1 == sid)) {
			return 1;
		}
	}
	return 0;
}

unsigned char OpenSprinkler::is_running(unsigned char sid) {
	return station_bits[(sid >> 3)] >> (sid & 0x07) & 1;
}

unsigned char OpenSprinkler::get_master_id(unsigned char mas) {
	return masters[mas][MASOPT_SID];
}

int16_t OpenSprinkler::get_on_adj(unsigned char mas) {
	int16_t onadj = water_time_decode_signed(masters[mas][MASOPT_ON_ADJ]);
	return onadj ? onadj : -1; // if on adj is 0, modify it to -1 to stagger with station
}

int16_t OpenSprinkler::get_off_adj(unsigned char mas) {
	int16_t offadj = water_time_decode_signed(masters[mas][MASOPT_OFF_ADJ]);
	return offadj ? offadj : 1; // if off adj is 0, modify it to +1 to stagger with station
}

int16_t OpenSprinkler::get_imin() {
	return iopts[IOPT_I_MIN_THRESHOLD]*10;
}

int16_t OpenSprinkler::get_imax() {
	unsigned char i = iopts[IOPT_I_MAX_LIMIT];
	if(hw_type == HW_TYPE_DC) {
		return (i == 0) ? (DEFAULT_OVERCURRENT_LIMIT+OVERCURRENT_DC_EXTRA) : (i == 255 ? -1 : i*10);
	}
	return (i == 0) ? DEFAULT_OVERCURRENT_LIMIT : (i == 255 ? -1 : i*10);
}

unsigned char OpenSprinkler::bound_to_master(unsigned char sid, unsigned char mas) {
	unsigned char bid = sid >> 3;
	unsigned char s = sid & 0x07;
	unsigned char attributes = 0;

	switch (mas) {
		case MASTER_1:
			attributes= attrib_mas[bid];
			break;
		case MASTER_2:
			attributes = attrib_mas2[bid];
			break;
		default:
			break;
	}

	return attributes & (1 << s);
}

unsigned char OpenSprinkler::get_station_gid(unsigned char sid) {
	return attrib_grp[sid];
}

