ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
/** Parse OTC configuration */
#if defined(USE_OTF)
void OpenSprinkler::parse_otc_config() {
	ArduinoJson::JsonDocument doc; // make sure this has the same scope as server and token
	const char *server = NULL;
	const char *token = NULL;
	int port = DEFAULT_OTC_PORT_DEV;
	int en = 0;

	char *config = tmp_buffer + 1;
	sopt_load(SOPT_OTC_OPTS, config);
	if (*config != 0) {
		// Add the wrapping curly braces to the string
		config = tmp_buffer;
		config[0] = '{';
		int len = strlen(config);
		config[len] = '}';
		config[len+1] = 0;

		ArduinoJson::DeserializationError error = ArduinoJson::deserializeJson(doc, config);

		// Test the parsing otherwise parse
		if (error) {
				DEBUG_PRINT(F("otf: deserializeJson() failed: "));
				DEBUG_PRINTLN(error.c_str());
		} else {
				en = doc["en"];
				token = doc["token"];
				server = doc["server"];
				port = doc["port"];
		}
	}

	otc.en = en;
	otc.token = token ? String(token) : "";
	otc.server = server ? String(server) : "";
	otc.port = port;
}
#endif

/** Setup function for options */
void OpenSprinkler::options_setup() {

	#if defined(ESP8266)
	LittleFS.mkdir(IOPTS_FILENAME);
	#endif
	//LittleFS.mkdir(DONE_FILENAME);
	if ( !file_exists(IOPTS_FILENAME) ) {
		DEBUG_PRINTLN("IOPTS missing");
		#if defined(ESP32)
		//LittleFS.mkdir(IOPTS_FILENAME);
		#endif
	}
	if ( file_read_byte(IOPTS_FILENAME, IOPT_FW_VERSION)<220 ) {
		DEBUG_PRINT("Wrong version: ");
		DEBUG_PRINTLN(file_read_byte(IOPTS_FILENAME, IOPT_FW_VERSION));
	}
	if ( !file_exists(DONE_FILENAME) ) {
		DEBUG_PRINTLN("DONE missing");
	}
	// Check reset conditions:
	if (file_read_byte(IOPTS_FILENAME, IOPT_FW_VERSION)!=OS_FW_VERSION ||  // fw major version has changed
			!file_exists(DONE_FILENAME)) {  // done file doesn't exist

		factory_reset();

	} else	{

		iopts_load();
		nvdata_load();
		last_reboot_cause = nvdata.reboot_cause;
		nvdata.reboot_cause = REBOOT_CAUSE_POWERON;
		nvdata_save();
		#if defined(ESP8266) || defined(ESP32)
		wifi_ssid = sopt_load(SOPT_STA_SSID);
		wifi_pass = sopt_load(SOPT_STA_PASS);
		sopt_load(SOPT_STA_BSSID_CHL, tmp_buffer);
		if(tmp_buffer[0]!=0) {
			char *mac = strchr(tmp_buffer, '@');
			if(mac!=NULL && isValidMAC(tmp_buffer)) { // check if bssid is valid MAC
				*mac=0; // terminate MAC string
				int chl = atoi(mac+1);
				if(chl>=0 && chl<=255) {
					str2mac(tmp_buffer, wifi_bssid);
					wifi_channel = chl;
				}
			}
		}
		#endif
		#if defined(USE_OTF)
		parse_otc_config();
		#endif

		attribs_load();
	}

	DEBUG_PRINTLN(F("Checking button state"));

#if defined(ARDUINO)	// handle AVR buttons
	unsigned char button = button_read(BUTTON_WAIT_NONE);

	#ifndef USE_ROTARY_ENCODER
	switch(button & BUTTON_MASK) {
	#ifndef BOOT_MENU_V2
	case BUTTON_1:
		// if BUTTON_1 is pressed during startup, go to 'reset all options'
		ui_set_options(IOPT_RESET);
		if (iopts[IOPT_RESET]) {
			pre_factory_reset();
			reboot_dev(REBOOT_CAUSE_RESET);
		}
		break;
	#endif
	case BUTTON_2:
	#if defined(ESP8266) || defined(ESP32)
		#ifndef BOOT_MENU_V2
			// if BUTTON_2 is pressed during startup, go to Test OS mode
			// only available for OS 3.0
			lcd_print_line_clear_pgm(PSTR("===Test Mode==="), 0);
			lcd_print_line_clear_pgm(PSTR("  B3:proceed"), 1);
			do {
				button = button_read(BUTTON_WAIT_NONE);
			} while(!((button&BUTTON_MASK)==BUTTON_3 && (button&BUTTON_FLAG_DOWN)));
			// set test mode parameters

			//iopts[IOPT_WIFI_MODE] = WIFI_MODE_STA;
			wifi_testmode = 1;
			#if defined(TESTMODE_SSID)
			wifi_ssid = TESTMODE_SSID;
			wifi_pass = TESTMODE_PASS;
			#else
			wifi_ssid = "ostest";
			wifi_pass = "opendoor";
			#endif
			button = 0;
		#else
			DEBUG_PRINTLN("Showing boot menu v2");
			ui_boot_menu(bootMenu,BOOT_MENU_ITEMS);
			button = 0; // will continue booting
		#endif
	#endif

		break;
	#ifndef BOOT_MENU_V2
	case BUTTON_3:
		// if BUTTON_3 is pressed during startup, enter Setup option mode
		lcd_print_line_clear_pgm(PSTR("==Set Options=="), 0);
		delay(DISPLAY_MSG_MS);
		lcd_print_line_clear_pgm(PSTR("B1/B2:+/-, B3:->"), 0);
		lcd_print_line_clear_pgm(PSTR("Hold B3 to save"), 1);
		do {
			button = button_read(BUTTON_WAIT_NONE);
		} while (!(button & BUTTON_FLAG_DOWN));
		lcd.clear();
		ui_set_options(0);
		if (iopts[IOPT_RESET]) {
			pre_factory_reset();
			reboot_dev(REBOOT_CAUSE_RESET);
		}
		break;
	#endif
	}
	#else
	// rotary encoder test
	// 4 pages: setup options, device password reset, factory reset, internal test
	// "on hold" will activate a function, normal click is "enter" or "hold for yes"
	button = button_read(BUTTON_WAIT_NONE);
	if ( (button & BUTTON_MASK) == BUTTON_2 ) {
		button = 0;
		ui_boot_menu(bootMenu, BOOT_MENU_ITEMS);	
	}
	
	/*
	
	if (iopts[IOPT_RESET]) {
		pre_factory_reset();
		reboot_dev(REBOOT_CAUSE_RESET);
	}
	*/
	#endif
	// turn on LCD backlight and contrast
	lcd_set_brightness();
	lcd_set_contrast();

	if (!button) {
		// flash screen
		lcd.setCursor(1, 0);
		lcd_print_line_clear_pgm(PSTR("OpenSprinkler"),0);
		#if defined(ESP32)
		lcd.setCursor(0, 2);
		lcd_print_line_clear_pgm(PSTR("ESP32 version"),2);
		#endif
		lcd.setCursor((hw_type==HW_TYPE_LATCH)?2:4, 1);
		lcd_print_pgm(PSTR("v"));
		unsigned char hwv = iopts[IOPT_HW_VERSION];
		lcd.print((char)('0'+(hwv/10)));
		lcd.print('.');
		#if defined(ESP8266) || defined(ESP32)
		lcd.print(hw_rev);
		#else
		lcd.print((char)('0'+(hwv%10)));
		#endif
		switch(hw_type) {
		case HW_TYPE_DC:
			lcd_print_pgm(PSTR(" DC"));
			break;
		case HW_TYPE_LATCH:
			lcd_print_pgm(PSTR(" LATCH"));
			break;
		default:
			lcd_print_pgm(PSTR(" AC"));
		}
		delay(1500); // sleep, and print out FW version
		#if defined(ARDUINO)
		lcd.setCursor(2, 1);
		lcd_print_pgm(PSTR("FW "));
		lcd.print((char)('0'+(OS_FW_VERSION/100)));
		lcd.print('.');
		lcd.print((char)('0'+((OS_FW_VERSION/10)%10)));
		lcd.print('.');
		lcd.print((char)('0'+(OS_FW_VERSION%10)));
		lcd.print('(');
		lcd.print(OS_FW_MINOR);
		lcd.print(')');
		delay(1000);
		lcd.clear(0,1);
		lcd.clear(0,2);
		#endif
	}
#endif
}

/** Load non-volatile controller status data from file */
void OpenSprinkler::nvdata_load() {
	file_read_block(NVCON_FILENAME, &nvdata, 0, sizeof(NVConData));
	old_status = status;
}

