ruimarinho/OpenSprinkler-Firmware-ESP32/OpenSprinkler.cpp
}


/** Button functions */
/** wait for button */
unsigned char OpenSprinkler::button_read_busy(unsigned char pin_butt, unsigned char waitmode, unsigned char butt, unsigned char is_holding) {

	int hold_time = 0;

	if (waitmode==BUTTON_WAIT_NONE || (waitmode == BUTTON_WAIT_HOLD && is_holding)) {
		if (digitalReadExt(pin_butt) != 0) return BUTTON_NONE;
		return butt | (is_holding ? BUTTON_FLAG_HOLD : 0);
	}

	while (digitalReadExt(pin_butt) == 0 &&
				 (waitmode == BUTTON_WAIT_RELEASE || (waitmode == BUTTON_WAIT_HOLD && hold_time<BUTTON_HOLD_MS))) {
		delay(BUTTON_DELAY_MS);
		hold_time += BUTTON_DELAY_MS;
	}
	if (is_holding || hold_time >= BUTTON_HOLD_MS)
		butt |= BUTTON_FLAG_HOLD;
	return butt;

}

#if defined(USE_ROTARY_ENCODER)

// interrupt driven encoder read
void OpenSprinkler::handleRotaryEncoderRotate() {
	lastEncoded = 0;
  	encoderValue = 0;
	
	int MSB = digitalRead(ROTARY_ENCODER_A_PIN);
  	int LSB = digitalRead(ROTARY_ENCODER_B_PIN);

  	int encoded = (MSB << 1) | LSB;
	int sum = (lastEncoded << 2) | encoded;
	int increment = encoderTable[sum & 0x0F];

	encoderValue += increment;
	encoderPos = encoderValue;
	lastEncoded = encoded;
}

/** read button and returns button value 'OR'ed with flag bits */
byte OpenSprinkler::button_read(byte waitmode)
{
	static byte old = BUTTON_NONE;
	byte curr = BUTTON_NONE;
	byte is_holding = (old&BUTTON_FLAG_HOLD);

	delay(BUTTON_DELAY_MS);

	if (digitalReadExt(PIN_BUTTON_2) == 0) {
		curr = button_read_busy(PIN_BUTTON_2, waitmode, BUTTON_2, is_holding);
	}

	// set flags in return value
	byte ret = curr;
	if (!(old&BUTTON_MASK) && (curr&BUTTON_MASK))
		ret |= BUTTON_FLAG_DOWN;
	if ((old&BUTTON_MASK) && !(curr&BUTTON_MASK))
		ret |= BUTTON_FLAG_UP;

	old = curr;

	return ret;
}
#else

/** read button and returns button value 'OR'ed with flag bits */
unsigned char OpenSprinkler::button_read(unsigned char waitmode)
{
	static unsigned char old = BUTTON_NONE;
	unsigned char curr = BUTTON_NONE;
	unsigned char is_holding = (old&BUTTON_FLAG_HOLD);

	delay(BUTTON_DELAY_MS);

	if (digitalReadExt(PIN_BUTTON_1) == 0) {
		curr = button_read_busy(PIN_BUTTON_1, waitmode, BUTTON_1, is_holding);
	} else if (digitalReadExt(PIN_BUTTON_2) == 0) {
		curr = button_read_busy(PIN_BUTTON_2, waitmode, BUTTON_2, is_holding);
	} else if (digitalReadExt(PIN_BUTTON_3) == 0) {
		curr = button_read_busy(PIN_BUTTON_3, waitmode, BUTTON_3, is_holding);
	}

	// set flags in return value
	unsigned char ret = curr;
	if (!(old&BUTTON_MASK) && (curr&BUTTON_MASK))
		ret |= BUTTON_FLAG_DOWN;
	if ((old&BUTTON_MASK) && !(curr&BUTTON_MASK))
		ret |= BUTTON_FLAG_UP;

	old = curr;

	return ret;
}
#endif // if defined(USE_ROTARY_ENCODER)

#if defined(ARDUINO) && ! defined(BOOT_MENU_V2)

/** user interface for setting options during startup */
void OpenSprinkler::ui_set_options(int oid)
{
	boolean finished = false;
	unsigned char button;
	int i=oid;

	while(!finished) {
		button = button_read(BUTTON_WAIT_HOLD);

		switch (button & BUTTON_MASK) {
		case BUTTON_1:
			if (i==IOPT_FW_VERSION || i==IOPT_HW_VERSION || i==IOPT_FW_MINOR ||
					i==IOPT_HTTPPORT_0 || i==IOPT_HTTPPORT_1 ||
					i==IOPT_PULSE_RATE_0 || i==IOPT_PULSE_RATE_1 ||
					i==IOPT_WIFI_MODE) break; // ignore non-editable options
			if (pgm_read_byte(iopt_max+i) != iopts[i]) iopts[i] ++;
			break;

		case BUTTON_2:
			if (i==IOPT_FW_VERSION || i==IOPT_HW_VERSION || i==IOPT_FW_MINOR ||
					i==IOPT_HTTPPORT_0 || i==IOPT_HTTPPORT_1 ||
					i==IOPT_PULSE_RATE_0 || i==IOPT_PULSE_RATE_1 ||
					i==IOPT_WIFI_MODE) break; // ignore non-editable options
			if (iopts[i] != 0) iopts[i] --; 
			break;

		case BUTTON_3:
			if (!(button & BUTTON_FLAG_DOWN)) break;
			if (button & BUTTON_FLAG_HOLD) {
				// long press, save options
				iopts_save();
				finished = true;
			}
			else {
				// click, move to the next option
				if (i==IOPT_USE_DHCP && iopts[i]) i += 9; // if use DHCP, skip static ip set
				else if (i==IOPT_HTTPPORT_0) i+=2; // skip IOPT_HTTPPORT_1
				else if (i==IOPT_PULSE_RATE_0) i+=2; // skip IOPT_PULSE_RATE_1
				else if (i==IOPT_MASTER_STATION && iopts[i]==0) i+=3; // if not using master station, skip master on/off adjust including two retired options
				else if (i==IOPT_MASTER_STATION_2&& iopts[i]==0) i+=3; // if not using master2, skip master2 on/off adjust
				else	{
					i = (i+1) % NUM_IOPTS;
				}
				if(i==IOPT_SEQUENTIAL_RETIRED) i++;
				if(i==IOPT_URS_RETIRED) i++;
				if(i==IOPT_RSO_RETIRED) i++;
				if (hw_type==HW_TYPE_AC && i==IOPT_BOOST_TIME) i++;	// skip boost time for non-DC controller
				if (i==IOPT_LATCH_ON_VOLTAGE && hw_type!=HW_TYPE_LATCH) i+= 2; // skip latch voltage defs for non-latch controllers
				if (i==IOPT_TARGET_PD_VOLTAGE && !(hw_rev==4 && hw_type==HW_TYPE_DC)) i++; // skip target pd voltage if not 3.4 or not DC type
				#if defined(ESP8266) || defined(ESP32)
				else if (lcd.type()==LCD_I2C && i==IOPT_LCD_CONTRAST) i+=3;
				#else
				else if (lcd.type()==LCD_I2C && i==IOPT_LCD_CONTRAST) i+=2;
				#endif
				// string options are not editable
			}
			break;
		}

		if (button != BUTTON_NONE) {
			lcd_print_option(i);
		}
	}
	lcd.noBlink();
}

#elif defined(ARDUINO)
/** user interface for setting options during startup, using the new, paged menu */
void OpenSprinkler::ui_boot_menu(MenuItem* menuItems, int menuSize)
{
	boolean finished = false;
	
	byte button;
	int encoderDelta = 0;
	int prevMenuItem = -1;
	int currentMenuItem = 0;
	void (*menu_f_p)();

	/*
	if ( currentMainmenu == nullptr ) {
		currentMenumenu = menuItems;
	}
	*/

	// rotary encoder is like 3 buttons: left: B1, button: B2, right: B3
	while(!finished) {
		#if defined(USE_ROTARY_ENODER)
		encoderDelta = encoderPos - lastEncoderPos;
		if ( encoderDelta != 0 ) {
			if ( encoderDelta < 0 ) {
				// CC rotate - BUTTON_1
				button |= BUTTON_1;
				button |= BUTTON_FLAG_UP;
			} else {
				// clockwise rotate - BUTTON_3
				button |= BUTTON_3;
				button |= BUTTON_FLAG_UP;
			}

		} else {
			button = button_read(BUTTON_WAIT_HOLD);
		}
		#else
		//DEBUG_PRINTLN("Button read");
		button = button_read(BUTTON_WAIT_HOLD);
		//DEBUG_PRINTLN(button);
		#endif

		switch (button & BUTTON_MASK) {
		case BUTTON_1:
			DEBUG_PRINTLN("Page-");
			// step left
			if ( currentMenuItem != 0 ) {
				currentMenuItem --;
			}
			break;

		case BUTTON_2:
			DEBUG_PRINTLN("B2");
			// enter
			//if (!(button & BUTTON_FLAG_DOWN)) {
			//	DEBUG_PRINTLN("Flag down");
			//	break;
			//}
			if (button & BUTTON_FLAG_HOLD) {
				DEBUG_PRINTLN("Long hold for item");
				if ( currentMenuItem == menuSize ) {
					// exit with long press
					DEBUG_PRINTLN("Last menuitem, exiting");
					finished = true;	
				} else {
					if ( menuItems[currentMenuItem].fn_name != nullptr ) {
						DEBUG_PRINTLN("Calling defined function");
						menu_f_p = menuItems[currentMenuItem].fn_name;
						menu_f_p();
					} else {
						DEBUG_PRINTLN("Nothing set to do now");
					}
					// long press, save options
					//	iopts_save();
					//finished = true; // will exit only on exit or if reboot needed
				}
			} else if ( button & BUTTON_FLAG_UP ) {
				DEBUG_PRINTLN("Should be short press");
				if ( currentMenuItem == menuSize  ) {
					DEBUG_PRINTLN("Last menuitem, exiting");
					// exit
					finished = true;
				} else {
					// submenu enter, if any
					if ( menuItems[currentMenuItem].subMenu != nullptr ) {
						// enter submenu 
						ui_boot_menu(menuItems[currentMenuItem].subMenu, menuItems[currentMenuItem].subMenuSize);
					}
				}
			} else {
				DEBUG_PRINTLN("Unknown state");
			}
			break;

		case BUTTON_3:
			DEBUG_PRINTLN("Page+");
			if ( currentMenuItem < menuSize ) currentMenuItem++;
			break;
		case BUTTON_NONE:
			//DEBUG_PRINTLN("No button");
			break;
		}

		// prevent flashing the screen
		if ( currentMenuItem != prevMenuItem ) {
			DEBUG_PRINT(F("Printing menu item "));
			DEBUG_PRINTLN(currentMenuItem);
			lcd_print_menu(menuItems[currentMenuItem].name);
		}
		prevMenuItem = currentMenuItem;
		//DEBUG_PRINTLN(button&BUTTON_FLAG_DOWN);
		//DEBUG_PRINTLN(button&BUTTON_FLAG_UP);
		//DEBUG_PRINTLN(button&BUTTON_FLAG_HOLD);
		//delay(50); // set to 350 for testing from 50
	}

	// if in mainmenu, than we should reboot!
	//if ( currentMainmenu == menuItems &&  ) {
	if ( menuItems[currentMenuItem].needReboot ) {
		reboot_dev(REBOOT_CAUSE_RESET);
	}

	lcd.noBlink();
}

